# NewSpace Method (Phase) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewSpace Method (Phase)
Document Class See Also
---
Creates a new unplaced space on a given phase.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Space NewSpace(
	Phase phase
)
```

Visual Basic
---
```text
Public Function NewSpace ( _
	phase As Phase _
) As Space
```

Visual C++
---
```text
public:
Space^ NewSpace(
	Phase^ phase
)
```

# ### Parameters
phase
    Type: Autodesk.Revit.DB..::..Phase The phase in which the space is to exist.
# ### Return Value
If successful the new space should be returned, otherwise nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the phase does not exist in the given document. |

# See Also
Document Class
NewSpace Overload
Autodesk.Revit.Creation Namespace